mafeiGitHub/stm32Mp3/httpserver/ftpServer.cpp
//{{{  includes
#include <string.h>
#include <ctype.h>
#include <stdlib.h>

#include "lwip/opt.h"
#include "lwip/arch.h"
#include "lwip/api.h"

#include "ftpServer.h"
#include "cmsis_os.h"

#include "cLcd.h"

#ifdef STM32F746G_DISCO
  #include "stm32746g_discovery.h"
  #include "stm32746g_discovery_ts.h"
  #include "stm32746g_discovery_audio.h"
  #include "stm32746g_discovery_sd.h"
#else
  #include "stm32f769i_discovery.h"
  #include "stm32f769i_discovery_ts.h"
  #include "stm32f769i_discovery_audio.h"
  #include "stm32f769i_discovery_sd.h"
#endif
#include "../fatfs/fatFs.h"
//}}}
//{{{  defines
#define FTP_VERSION              "FTP-2015-07-31"
#define FTP_USER                 "nnn"
#define FTP_PASS                 "nnn"

#define FTP_SERVER_PORT          21
#define FTP_DATA_PORT            55600         // Data port in passive mode
#define FTP_TIME_OUT             10            // Disconnect client after 5 minutes of inactivity
#define FTP_PARAM_SIZE           256 + 8
#define FTP_CWD_SIZE             256 + 8  // max size of a directory name

#define FTP_NBR_CLIENTS          5
#define FTP_BUF_SIZE             512
#define SERVER_THREAD_STACK_SIZE 256
#define FTP_THREAD_STACK_SIZE    ( 1600 + FTP_BUF_SIZE + ( 5 * 256 ))
#define FTP_THREAD_PRIORITY      (LOWPRIO + 2)
//}}}

static cFatFs* fatFs = nullptr;

enum dcm_type { NOTSET  = 0, PASSIVE = 1, ACTIVE  = 2, };
//{{{
class FtpServer {
public:
  void service (int8_t n, struct netconn* dscn);

private:
  bool processCommand (char* command, char* parameters);
  int8_t readCommand();

  void sendBegin (const char* s);
  void sendCat (const char* s);
  void sendWrite (const char* s);
  void sendCatWrite (const char* s);
  void sendWrite();

  bool listenDataConn();
  bool dataConnect();
  void dataClose();
  void dataWrite (const char* data);
  void closeTransfer();

  bool makePathFrom (char* fullName, char* param);
  bool makePath (char* fullName);
  bool fs_exists (char* path);

  char* int2strZ (char* s, uint32_t i, int8_t z );
  char* int2str (char* s, int32_t i, int8_t ls );
  char* i2str (int32_t i );

  char* makeDateTimeStr (uint16_t date, uint16_t time);
  int8_t getDateTime (uint16_t* pdate, uint16_t* ptime);

  struct    netconn* listdataconn, * dataconn, * ctrlconn;
  struct    netbuf* inbuf;
  struct    ip_addr ipclient;
  struct    ip_addr ipserver;

  cFileInfo finfo;

  uint16_t  dataPort;
  int8_t    cmdStatus;                    // status of ftp command connection
  char      command [5];                 // command sent by client
  char      parameters [FTP_PARAM_SIZE]; // parameters sent by client
  char      cwdName [FTP_CWD_SIZE];      // name of current directory
  char      cwdRNFR [FTP_CWD_SIZE];      // name of origin directory for Rename command
  char      path [FTP_CWD_SIZE];
  char      str [25];
  uint32_t  bytesTransfered;
  int8_t    nerr;
  uint8_t   num;
  char      buf [FTP_BUF_SIZE];           // data buffer for communication
  uint16_t  pbuf;
  dcm_type  dataConnMode;
  };
//}}}

//{{{
char* FtpServer::int2strZ (char* s, uint32_t i, int8_t z ) {

  char* psi = s + abs( z );

  * -- psi = 0;
  if (i == 0)
    * -- psi = '0';

  for (; i; i /= 10)
    * -- psi = '0' + i % 10;

  if (z < 0)
    while (psi > s)
      * -- psi = '0';

  return psi;
  }
//}}}
//{{{
char* FtpServer::int2str (char* s, int32_t i, int8_t ls ) {

  if (i >= 0)
    return int2strZ( s, i, ls );

  char* pstr = int2strZ (s + 1, -i, ls - 1);
  * -- pstr = '-';
  return pstr;
  }
//}}}
//{{{
char* FtpServer::i2str (int32_t i) {
  return int2str (str, i, 12);
  }
//}}}

//{{{
void FtpServer::sendBegin (const char* s) {
  strncpy (buf, s, FTP_BUF_SIZE);
  }
//}}}
//{{{
void FtpServer::sendCat (const char* s) {

  size_t len = FTP_BUF_SIZE - strlen (buf);
  strncat (buf, s, len);
  }
//}}}
//{{{
void FtpServer::sendWrite (const char* s ) {

  sendBegin (s);
  sendWrite();
  }
//}}}
//{{{
void FtpServer::sendCatWrite (const char* s) {

  sendCat (s);
  sendWrite();
  }
//}}}
//{{{
void FtpServer::sendWrite() {

  if (strlen( buf ) + 2 < FTP_BUF_SIZE)
    strcat (buf, "\r\n");

  netconn_write (ctrlconn, buf, strlen(buf), NETCONN_COPY);
  }
//}}}

//{{{
char* FtpServer::makeDateTimeStr (uint16_t date, uint16_t time) {
// Create string YYYYMMDDHHMMSS from date and time

  int2strZ (str, ((date & 0xFE00 ) >> 9 ) + 1980, -5);
  int2strZ (str + 4, (date & 0x01E0 ) >> 5, -3);
  int2strZ (str + 6, date & 0x001F, -3);
  int2strZ (str + 8, (time & 0xF800 ) >> 11, -3);
  int2strZ (str + 10, (time & 0x07E0 ) >> 5, -3);
  int2strZ (str + 12, (time & 0x001F ) << 1, -3);
  return str;
  }
//}}}
//{{{
int8_t FtpServer::getDateTime (uint16_t * pdate, uint16_t* ptime) {
// Calculate date and time from first parameter sent by MDTM command (YYYYMMDDHHMMSS)
// Date/time are expressed as a 14 digits long string
//   terminated by a space and followed by name of file

  if ( strlen( parameters ) < 15 || parameters[ 14 ] != ' ' )
    return 0;
  for( uint8_t i = 0; i < 14; i++ )
    if( ! isdigit( parameters[ i ]))
      return 0;

  parameters[ 14 ] = 0;
  * ptime = atoi( parameters + 12 ) >> 1;   // seconds
  parameters[ 12 ] = 0;
  * ptime |= atoi( parameters + 10 ) << 5;  // minutes
  parameters[ 10 ] = 0;
  * ptime |= atoi( parameters + 8 ) << 11;  // hours
  parameters[ 8 ] = 0;
  * pdate = atoi( parameters + 6 );         // days
  parameters[ 6 ] = 0;
  * pdate |= atoi( parameters + 4 ) << 5;   // months
  parameters[ 4 ] = 0;
  * pdate |= ( atoi( parameters ) - 1980 ) << 9;       // years

  return 15;
  }
//}}}

//{{{
int8_t FtpServer::readCommand() {
// return: -4 time out
//         -3 error receiving data
//         -2 command line too long
//         -1 syntax error
//          0 command without parameters
//          >0 length of parameters

  char* pbuf;
  uint16_t buflen;
  int8_t rc = 0;
  int8_t i;
  char car;

  command[0] = 0;
  parameters[0] = 0;
  nerr = netconn_recv (ctrlconn, & inbuf);
  if (nerr == ERR_TIMEOUT)
    return -4;
  if (nerr != ERR_OK)
    return -3;

  netbuf_data (inbuf, (void**)&pbuf, &buflen);
  if (buflen == 0)
    goto deletebuf;
  i = 0;
  car = pbuf[0];
  do {
    if (!isalpha (car))
      break;
    command[i++] = car;
    car = pbuf[i];
    }

  while (i < buflen && i < 4);
  command[i] = 0;
  if (car != ' ')
    goto deletebuf;

  do
    if (i > buflen + 2)
      goto deletebuf;
    while (pbuf[i++] == ' ');

  rc = i;
  do
    car = pbuf [rc++];
    while (car != '\n' && car != '\r' && rc < buflen);

