mafeiGitHub/stm32Mp3/httpserver/ftpServer.cpp
  if (rc == buflen) {
    rc = -1;
    goto deletebuf;
    }

  if (rc - i - 1 >= FTP_PARAM_SIZE) {
    rc = -2;
    goto deletebuf;
    }

  strncpy (parameters, pbuf + i - 1, rc - i);
  parameters[rc - i] = 0;
  rc = rc - i;

  deletebuf:

  cLcd::debug ("rxcmd " + cLcd::dec (num) + " " + command + " " + parameters);

  netbuf_delete (inbuf);
  return rc;
  }
//}}}
//{{{
bool FtpServer::listenDataConn() {

  bool ok = true;

  // If this is not already done, create the TCP connection handle to listen to client to open data connection
  if (listdataconn == NULL) {
    listdataconn = netconn_new (NETCONN_TCP);

    ok = listdataconn != NULL;
    if (ok) {
      // Bind listdataconn to port (FTP_DATA_PORT+num) with default IP address
      nerr = netconn_bind (listdataconn, IP_ADDR_ANY, dataPort );
      ok = nerr == ERR_OK;
      }

    if (ok) {
      // Put the connection into LISTEN state
      nerr = netconn_listen (listdataconn );
      ok = nerr == ERR_OK;
      }
    }

  return ok;
  }
//}}}
//{{{
bool FtpServer::dataConnect() {

  nerr = ERR_CONN;

  if (dataConnMode == NOTSET)
    goto error;

  if (dataConnMode == PASSIVE) {
    if (listdataconn == NULL)
      goto error;
    // Wait for connection from client during 500 ms
    netconn_set_recvtimeout( listdataconn, 500);
    nerr = netconn_accept( listdataconn, & dataconn );
    if (nerr != ERR_OK ) 
      goto error;
    }
  else {
    //  Create a new TCP connection handle
    dataconn = netconn_new (NETCONN_TCP);
    if (dataconn == NULL)
      goto error;

    nerr = netconn_bind (dataconn, IP_ADDR_ANY, 0); //dataPort );
    //  Connect to data port with client IP address
    if (nerr != ERR_OK )
      goto delconn;
    nerr = netconn_connect (dataconn, & ipclient, dataPort);
    if (nerr != ERR_OK )
      goto delconn;
    }
  return true;

delconn:
  if (dataconn != NULL) {
    netconn_delete (dataconn);
    dataconn = NULL;
    }

error:
  sendWrite ("425 No data connection");
  return false;
  }
//}}}
//{{{
void FtpServer::dataClose() {

  dataConnMode = NOTSET;
  if (dataconn == NULL)
    return;

  netconn_close (dataconn);
  netconn_delete (dataconn);

  dataconn = NULL;
  }
//}}}
//{{{
void FtpServer::dataWrite (const char* data) {

  netconn_write (dataconn, data, strlen(data), NETCONN_COPY);
  }
//}}}

//{{{
bool FtpServer::makePathFrom (char* fullName, char* param) {
// Make complete path/name from cwdName and parameters
// 3 possible cases:
//   parameters can be absolute path, relative path or only the name
// parameters:
//   fullName : where to store the path/name
// return:
//   true, if done

  // Root or empty?
  if( ! strcmp( param, "/") || strlen( param ) == 0 ) {
    strcpy( fullName, "/");
    return true;
    }
  // If relative path, concatenate with current dir
  if( param[0] != '/' ) {
    strcpy( fullName, cwdName );
    if( fullName[ strlen( fullName ) - 1 ] != '/' )
      strncat( fullName, "/", FTP_CWD_SIZE );
    strncat( fullName, param, FTP_CWD_SIZE );
    }
  else
    strcpy( fullName, param );

  // If ends with '/', remove it
  uint16_t strl = strlen( fullName ) - 1;
  if( fullName[ strl ] == '/' && strl > 1 )
    fullName[ strl ] = 0;

  if( strlen( fullName ) < FTP_CWD_SIZE )
    return true;

  sendWrite( "500 Command line too long");

  return false;
  }
//}}}
//{{{
bool FtpServer::makePath (char* fullName) {

  return makePathFrom (fullName, parameters);
  }
//}}}
//{{{
void FtpServer::closeTransfer() {

  if (bytesTransfered > 0) {
    sendBegin ("226-File successfully transferred\r\n");
    sendCat ("226 ");
    sendCat (" xxx ms, ");
    sendCatWrite (" bytes/s");
    }
  else
    sendWrite ("226 File successfully transferred");
  }
//}}}

//{{{
bool FtpServer::fs_exists (char* path) {
// Return true if a file or directory exists
// parameters:
//   path : absolute name of file or directory

  if (!strcmp( path, "/"))
    return true;

  char* path0 = path;
  return fatFs->stat (path0, finfo) == FR_OK;
  }
//}}}
//{{{
bool FtpServer::processCommand (char* command, char* parameters) {

  if (!strcmp( command, "PWD") || (!strcmp( command, "CWD") && !strcmp( parameters, ".")))  // 'CWD .' same as PWD
  //{{{  PWD - working directory
  {
    sendBegin ("257 \"");
    sendCat (cwdName);
    sendCatWrite ("\" is your current directory");
  }
  //}}}
  else if (!strcmp( command, "CWD"))
  //{{{  CWD - Change Working Directory
  {
    if( strlen( parameters ) == 0 )
      sendWrite( "501 No directory name");
    else if( makePath( path )) {
      if( fs_exists( path ))
      {
        strcpy( cwdName, path );
        sendWrite( "250 Directory successfully changed.");
      }
      else
        sendWrite( "550 Failed to change directory.");
    }
  }
  //}}}
  else if (!strcmp( command, "CDUP"))
  //{{{  CDUP - Change to Parent Directory
  {
    bool ok = false;

    if( strlen( cwdName ) > 1 )  // do nothing if cwdName is root
    {
      // if cwdName ends with '/', remove it (must not append)
      if( cwdName[ strlen( cwdName ) - 1 ] == '/' )
        cwdName[ strlen( cwdName ) - 1 ] = 0;
      // search last '/'
      char * pSep = strrchr( cwdName, '/' );
      ok = pSep > cwdName;
      // if found, ends the string on its position
      if( ok )
      {
        * pSep = 0;
        ok = fs_exists( cwdName );
      }
    }
    // if an error appends, move to root
    if (!ok )
      strcpy( cwdName, "/");
    sendBegin( "200 Ok. Current directory is ");
    sendCatWrite( cwdName );
  }
  //}}}
  else if (!strcmp( command, "DELE"))
  //{{{  DELE - Delete a File
  {
    if( strlen( parameters ) == 0 )
      sendWrite( "501 No file name");
    else if( makePath( path ))
    {
      if (!fs_exists( path ))
      {
        sendBegin( "550 File ");
        sendCat( parameters );
        sendCatWrite( " not found");
      }
      else
      {
        uint8_t ffs_result = fatFs->unlink (path);
        if( ffs_result == FR_OK )
        {
          sendBegin( "250 Deleted ");
          sendCatWrite( parameters );
        }
        else
        {
          sendBegin( "450 Can't delete ");
          sendCatWrite( parameters );
        }
      }
    }
  }
  //}}}
  else if (!strcmp( command, "FEAT")) {
  //{{{  FEAT - New Features
  sendBegin ( "211-Extensions supported:\r\n");
  sendCat (" MDTM\r\n");
  sendCat (" MLSD\r\n");
  sendCat (" SIZE\r\n");
  sendCat (" SITE FREE\r\n");
  sendCatWrite ("211 End.");
  }
  //}}}
  else if (!strcmp( command, "LIST") || ! strcmp( command, "NLST"))
  //{{{  LIST and NLST - List
  {
    uint16_t nm = 0;
    cDirectory dir (cwdName);
    if (dir.getError()) {
      sendBegin( "550 Can't open directory ");
      sendCatWrite( cwdName );
      }
    else if( dataConnect()) {
      sendWrite( "150 Accepted data connection");
      for (;;) {
        if ((dir.findNext (finfo) != FR_OK) || finfo.mShortFileName[0] == 0)
          break;
        if (finfo.mShortFileName[0] == '.')
          continue;

