mafeiGitHub/stm32Mp3/httpserver/ftpServer.cpp
        if (!strcmp (command, "LIST")) {
          if (finfo.mAttribute & AM_DIR)
            strcpy (buf, "+/");
          else {
            strcpy (buf, "+r,s");
            strcat (buf, i2str( finfo.mFileSize));
            }
          strcat (buf, ",\t");
          strcat (buf, finfo.mLongFileName[0] == 0 ? finfo.mShortFileName : finfo.mLongFileName);
          }
        else
          strcpy (buf, finfo.mLongFileName[0] == 0 ? finfo.mShortFileName : finfo.mLongFileName);
        strcat ( buf, "\r\n");
        dataWrite (buf);
        nm ++;
        }

      sendWrite ("226 Directory send OK.");
      dataClose();
      }
    }
  //}}}
  else if (!strcmp( command, "MDTM"))
  //{{{  MDTM - File Modification Time RFC 3659
  {
    char * fname;
    uint16_t date, time;
    uint8_t gettime;

    gettime = getDateTime( & date, & time );
    fname = parameters + gettime;

    if( strlen( fname ) == 0 )
      sendWrite( "501 No file name");
    else if( makePathFrom( path, fname )) {
      if (!fs_exists( path )) {
        sendBegin( "550 File ");
        sendCat( fname );
        sendCatWrite( " not found");
      }
      else if( gettime ) {
        finfo.mDate = date;
        finfo.mTime = time;
        if (fatFs->utime (path, finfo) == FR_OK )
          sendWrite( "200 Ok");
        else
          sendWrite( "550 Unable to modify time");
      }
      else {
        sendBegin( "213 ");
        sendCatWrite( makeDateTimeStr( finfo.mDate, finfo.mTime ));
      }
    }
  }
  //}}}
  else if (!strcmp( command, "MLSD")) {
  //{{{  MLSD - Listing for Machine Processing RFC 3659
  uint16_t nm = 0;

  cDirectory dir (cwdName);
  if (dir.getError()) {
    sendBegin ("550 Can't open directory ");
    sendCatWrite (parameters);
    }

  else if (dataConnect()) {
    sendWrite( "150 Accepted data connection");
    while (dir.find (finfo) == FR_OK && !finfo.getEmpty()) {
      if (finfo.mShortFileName[0] == '.')
        continue;
      strcpy (buf, "Type=");
      strcat (buf, finfo.mAttribute & AM_DIR ? "dir" : "file");
      strcat (buf, ";Size=");
      strcat (buf, i2str (finfo.mFileSize));
      if (finfo.mDate != 0) {
        strcat( buf, ";Modify=");
        strcat( buf, makeDateTimeStr (finfo.mDate, finfo.mTime));
        }
      strcat (buf, "; ");
      strcat (buf, finfo.mLongFileName[0] == 0 ? finfo.mShortFileName : finfo.mLongFileName);
      strcat (buf, "\r\n");
      dataWrite (buf);
      nm++;
      }

    sendBegin ("226-options: -a -l\r\n");
    sendCat ("226 ");
    sendCat (i2str (nm));
    sendCatWrite (" matches total");
    dataClose();
    }
  }
  //}}}
  else if (!strcmp( command, "MKD"))
  //{{{  MKD - Make Directory
  {
    if( strlen( parameters ) == 0 )
      sendWrite( "501 No directory name");
    else if( makePath (path)) {
      if (fs_exists (path)) {
        sendBegin("521 \"");
        sendCat (parameters);
        sendCatWrite ("\" directory already exists");
      }
      else {
        //DEBUG_PRINT(  "Creating directory %s\r\n", parameters );
        uint8_t ffs_result = fatFs->makeSubDirectory (path);

        //RTCDateTime timespec;
        //struct tm stm;
        //rtcGetTime( & RTCD1, & timespec );
        //rtcConvertDateTimeToStructTm( & timespec, & stm, NULL );
        //DEBUG_PRINT( "Date/Time: %04u/%02u/%02u %02u:%02u:%02u\r\n",
        //             stm.tm_year + 1900, stm.tm_mon + 1, stm.tm_mday,
        //             stm.tm_hour, stm.tm_min, stm.tm_sec );


        if (ffs_result == FR_OK) {
          sendBegin ("257 \"");
          sendCat (parameters);
          sendCatWrite ("\" created");
          }
        else {
          sendBegin ("550 Can't create \"");
          sendCat (parameters);
          sendCatWrite ("\"");
        }
      }
    }
  }
  //}}}
  else if (!strcmp( command, "MODE"))
  //{{{  MODE - Transfer Mode
  {
    if (!strcmp( parameters, "S"))
      sendWrite( "200 S Ok");
    // else if (!strcmp( parameters, "B"))
    //  sendWrite( "200 B Ok");
    else
      sendWrite( "504 Only S(tream) is suported");
  }
  //}}}
  else if (!strcmp( command, "NOOP"))
  //{{{  NOOP
  {
    sendWrite( "200 Zzz...");
  }
  //}}}
  else if (!strcmp( command, "PASV"))
  //{{{  PASV - Passive Connection management
  {
    if( listenDataConn())
    {
      dataClose();
      sendBegin( "227 Entering Passive Mode (");
      sendCat( i2str( ip4_addr1( & ipserver ))); sendCat( ",");
      sendCat( i2str( ip4_addr2( & ipserver ))); sendCat( ",");
      sendCat( i2str( ip4_addr3( & ipserver ))); sendCat( ",");
      sendCat( i2str( ip4_addr4( & ipserver ))); sendCat( ",");
      sendCat( i2str( dataPort >> 8 )); sendCat( ",");
      sendCat( i2str( dataPort & 255 )); sendCatWrite( ").");
      //DEBUG_PRINT( "Data port set to %U\r\n", dataPort );
      dataConnMode = PASSIVE;
    }
    else
    {
      sendWrite( "425 Can't set connection management to passive");
      dataConnMode = NOTSET;
    }
  }
  //}}}
  else if (!strcmp( command, "PORT"))
  //{{{  PORT - Data Port
  {
    uint8_t ip[4];
    uint8_t i;
    dataClose();
    // get IP of data client
    char * p = NULL;
    if( strlen( parameters ) > 0 )
    {
      p = parameters - 1;
      for( i = 0; i < 4 && p != NULL; i ++ )
      {
        ip[ i ] = atoi( ++ p );
        p = strchr( p, ',' );
      }
      // get port of data client
      if( i == 4 && p != NULL )
      {
        dataPort = 256 * atoi( ++ p );
        p = strchr( p, ',' );
        if( p != NULL )
          dataPort += atoi( ++ p );
      }
    }
    if( p == NULL )
    {
      sendWrite( "501 Can't interpret parameters");
      dataConnMode = NOTSET;
    }
    else
    {
      IP4_ADDR( & ipclient, ip[0], ip[1], ip[2], ip[3] );
      sendWrite( "200 PORT command successful");
      //DEBUG_PRINT( "Data IP set to %u:%u:%u:%u\r\n", ip[0], ip[1], ip[2], ip[3] );
      //DEBUG_PRINT( "Data port set to %U\r\n", dataPort );
      dataConnMode = ACTIVE;
    }
  }
  //}}}
  else if (!strcmp( command, "RETR"))
  //{{{  RETR - Retrieve
  {
    if (strlen (parameters) == 0 )
      sendWrite ( "501 No file name");
    else if (makePath (path)) {
      if (!fs_exists (path)) {
        sendBegin ("550 File ");
        sendCat (parameters);
        sendCatWrite (" not found");
        }
      else {
        cFile file (path, FA_READ);
        if (file.getError() != FR_OK) {
          sendBegin( "450 Can't open ");
          sendCatWrite( parameters );
          }
        else if (dataConnect()) {
          int nb;

          //DEBUG_PRINT( "Sending %s\r\n", parameters );
          sendBegin ("150-Connected to port ");
          sendCat (i2str( dataPort));
          sendCat ("\r\n150 ");
          sendCat (i2str (file.getSize()));
          sendCatWrite (" bytes to download");
          bytesTransfered = 0;

          //DEBUG_PRINT( "Start transfert\r\n");
          while (file.read (buf, FTP_BUF_SIZE, nb) == FR_OK && nb > 0 ) {
            netconn_write( dataconn, buf, nb, NETCONN_COPY );
            bytesTransfered += nb;
            //DEBUG_PRINT( "Sent %u bytes\r", bytesTransfered );
            }
          //DEBUG_PRINT( "\n");
          closeTransfer();
          dataClose();
        }
      }
    }
  }
  //}}}
  else if (!strcmp( command, "RMD"))
  //{{{  RMD - Remove a Directory
  {
    if( strlen( parameters ) == 0 )
      sendWrite( "501 No directory name");
    else if( makePath( path ))
    {
      //DEBUG_PRINT(  "Deleting %s\r\n", path );
      if (!fs_exists( path )) {
        sendBegin( "550 Directory \"");
        sendCat( parameters );
        sendCatWrite( "\" not found");
      }
      else if( fatFs->unlink( path ) == FR_OK) {
        sendBegin( "250 \"");
        sendCat( parameters );
        sendCatWrite( "\" removed");
      }
      else {
        sendBegin( "501 Can't delete \"");
        sendCat( parameters );
        sendCatWrite( "\"");
      }
    }
  }
  //}}}
  else if (!strcmp( command, "RNFR"))
  //{{{  RNFR - Rename From
  {
    cwdRNFR[ 0 ] = 0;
    if( strlen( parameters ) == 0 )
      sendWrite( "501 No file name");
    else if( makePath( cwdRNFR )) {
      if (!fs_exists( cwdRNFR )) {
        sendBegin( "550 File ");
        sendCat( parameters );
        sendCatWrite( " not found");
      }
      else
      { //DEBUG_PRINT( "Renaming %s\r\n", cwdRNFR );
        sendWrite( "350 RNFR accepted - file exists, ready for destination");
      }
    }
  }
  //}}}
  else if (!strcmp( command, "RNTO"))
  //{{{  RNTO - Rename To
  {
    char sdir[ FTP_CWD_SIZE ];
    if( strlen( cwdRNFR ) == 0 )
      sendWrite( "503 Need RNFR before RNTO");
    else if( strlen( parameters ) == 0 )
      sendWrite( "501 No file name");
    else if( makePath( path )) {
      if( fs_exists( path )) {
        sendBegin( "553 ");
        sendCat( parameters );
        sendCatWrite( " already exists");
        }
      else {
        strcpy( sdir, path );
        char * psep = strrchr( sdir, '/' );
        bool fail = psep == NULL;
        if (!fail ) {
          if( psep == sdir )
            psep++;
          *psep = 0;
          fail = ! ( fs_exists( sdir ) && ( finfo.mAttribute & AM_DIR || ! strcmp( sdir, "/")));
          if( fail ) {
            sendBegin( "550 \"");
            sendCat( sdir );
            sendCatWrite( "\" is not directory");
            }
          else {
            if (fatFs->rename (cwdRNFR, path ) == FR_OK)
              sendWrite( "250 File successfully renamed or moved");
            else
              fail = true;
            }
          }
        if (fail)
          sendWrite( "451 Rename/move failure");
        }
      }
    }
  //}}}
  else if (!strcmp( command, "SITE"))
  //{{{  SITE - System command
  {
    if (!strcmp( parameters, "FREE")) {
      //uint32_t free_clust;
      fatFs->getFreeSectors();
      sendBegin( "211 ");
      //sendCat( i2str( free_clust * fs->csize >> 11 ));
      sendCat( i2str (100));
      sendCat( " MB free of ");
      //sendCat( i2str((fs->n_fatent - 2) * fs->csize >> 11 ));
      sendCat( i2str(1000));
      sendCatWrite( " MB capacity");
    }
    else {
      sendBegin( "500 Unknow SITE command ");
      sendCatWrite( parameters );
    }
  }
  //}}}
  else if (!strcmp( command, "SIZE")) {
  //{{{  SIZE - Size of the file
  if (strlen (parameters) == 0)
    sendWrite ("501 No file name");
  else if (makePath (path)) {
    if (!strcmp (path, "/"))
      sendWrite ( "550 No such file");
    else if ((fatFs->stat (path, finfo) == FR_OK) && !finfo.isDirectory()) {
      sendBegin ("213 ");
      sendCatWrite (i2str (finfo.mFileSize));
      }
    else
      sendWrite ( "550 No such file");
    }
  }
  //}}}
  else if (!strcmp( command, "STAT"))
  //{{{  STAT - Status command
  {
    sendBegin( "211-FTP server status\r\n");
    sendCat( " Local time is ");
    sendCat( "\r\n ");
    sendCat( " xx user(s) currently connected to up to ");
    sendCat( i2str( FTP_NBR_CLIENTS ));
    sendCat( "\r\n You will be disconnected after ");
    sendCat( i2str( FTP_TIME_OUT ));
    sendCat( " minutes of inactivity\r\n");
    sendCatWrite( "211 End.");
  }
  //}}}
  else if (!strcmp( command, "STOR"))
  //{{{  STOR - Store
    {
    if (strlen  (parameters) == 0)
      sendWrite ("501 No file name");
    else if (makePath (path)) {
      cFile file (path, FA_CREATE_ALWAYS | FA_WRITE );
      if (file.getError() != FR_OK ) {
        sendBegin( "451 Can't open/create ");
        sendCatWrite( parameters );
        }
      else if (dataConnect()) {
        struct pbuf* rcvbuf = NULL;
        void* prcvbuf;
        uint16_t buflen = 0;
        uint16_t off = 0;
        uint16_t copylen;
        int8_t  ferr = 0;
        UINT nb;

        sendBegin ("150 Connected to port ");
        sendCatWrite (i2str (dataPort));
        bytesTransfered = 0;
        do {
          nerr = netconn_recv_tcp_pbuf (dataconn, &rcvbuf);
          if (nerr != ERR_OK)
            break;
          prcvbuf = rcvbuf->payload;
          buflen = rcvbuf->tot_len;
          while (buflen > 0) {
            if (buflen <= FTP_BUF_SIZE - off)
              copylen = buflen;
            else
              copylen = FTP_BUF_SIZE - off;
            buflen -= copylen;
            memcpy (buf + off, prcvbuf, copylen);
            prcvbuf += copylen;
            off += copylen;
            if (off == FTP_BUF_SIZE) {
              if (ferr == 0 )
                ferr = file.write (buf, FTP_BUF_SIZE, nb);
              off = 0;
              }
            bytesTransfered += copylen;
            }
          } while (true); // ferr == 0 );

