mafeiGitHub/stm32Mp3/httpserver/ftpServer.cpp
        if (off > 0 && ferr == 0)
          ferr = file.write (buf, off, nb);

        if (nerr != ERR_CLSD) {
          sendBegin ("451 Requested action aborted: communication error ");
          sendCatWrite (i2str (abs(nerr)));
          }
        if (ferr != 0) {
          sendBegin ("451 Requested action aborted: file error ");
          sendCatWrite (i2str (abs (ferr)));
          }
        dataClose();
        closeTransfer();
        }
      }
    }
  //}}}
  else if (!strcmp( command, "STRU"))
  //{{{  STRU - File Structure
  {
    if (!strcmp( parameters, "F"))
      sendWrite( "200 F Ok");
    else
      sendWrite( "504 Only F(ile) is suported");
  }
  //}}}
  else if (!strcmp( command, "SYST")) {
    //{{{  SYST - command
    sendWrite ("215 WIN32 ftpdmin v. 0.96");
    }
    //}}}
  else if (!strcmp( command, "TYPE")) {
  //{{{  TYPE - Data Type
  if (!strcmp (parameters, "A"))
    sendWrite ("200 TYPE is now ASCII");
  else if (!strcmp (parameters, "I"))
    sendWrite ("200 TYPE is now 8-bit binary");
  else
    sendWrite ("504 Unknow TYPE");
  }
  //}}}
  else if (!strcmp( command, "USER")) {
    //{{{  USER - command
    //if (!strcmp (parameters, FTP_USER))
      sendWrite ("331 OK. Password required");
    //else
    //  sendWrite ("530 ");
    }
    //}}}
  else if (!strcmp( command, "PASS")) {
    //{{{  PASS - command
    //if (!strcmp (parameters, FTP_PASS))
      sendWrite ("230 OK.");
    //else
    //  sendWrite ("530 ");
    }
    //}}}
  else if (! strcmp( command, "QUIT"))
    return false;
  else
    sendWrite ("500 Unknow command");
  return true;
  }
//}}}

//{{{
void FtpServer::service (int8_t n, struct netconn* ctrlcn) {

  uint16_t dummy;
  struct ip_addr ippeer;
  strcpy (cwdName, "/");  // Set the root directory
  cwdRNFR[0] = 0;
  num = n;
  ctrlconn = ctrlcn;
  listdataconn = NULL;
  dataconn = NULL;
  dataPort = FTP_DATA_PORT + num;
  cmdStatus = 0;
  dataConnMode = NOTSET;

  //  Get the local and peer IP
  netconn_addr (ctrlconn, &ipserver, &dummy);
  netconn_peer (ctrlconn, &ippeer, &dummy);

  sendBegin ("220---   Welcome to FTP Server!   ---\r\n");
  sendCat ("   ---  for ChibiOs & STM32-E407  ---\r\n");
  sendCat ("   ---   by Jean-Michel Gallego   ---\r\n");
  sendCat ("220 --   Version ");
  sendCat (FTP_VERSION);
  sendCatWrite ("   --");

  //  Wait for user commands, disconnect if FTP_TIME_OUT minutes of inactivity
  netconn_set_recvtimeout (ctrlconn, FTP_TIME_OUT * 60 * 1000);
  while (true) {
    int8_t err = readCommand();
    if (err == -4) // time out
      goto close;
    if (err < 0)
      goto close;
    if (!processCommand (command, parameters))
      goto bye;
    }

bye:
  sendWrite ("221 Goodbye");

close:
  dataClose();
  if (listdataconn != NULL) {
    netconn_close (listdataconn);
    netconn_delete (listdataconn);
    }
  }
//}}}

//{{{
static void ftpServerThread (void const* argument) {

  cLcd::debug ("ftpServerThread");

  BSP_SD_Init();
  if (BSP_SD_IsDetected() == SD_PRESENT)
    cLcd::debug ("ftpServer SD CARD");

  fatFs = cFatFs::create();
  if (fatFs->mount() != FR_OK) {
    // fatfs mount error, return
    cLcd::debug ("fatFs mount problem");
    osThreadTerminate (NULL);
    return;
    }
  cLcd::debug (fatFs->getLabel() + " vsn:" + cLcd::hex (fatFs->getVolumeSerialNumber()) +
               " freeSectors:" + cLcd::dec (fatFs->getFreeSectors()));

  struct netconn* ftpconn;
  FtpServer ftpSrv;

  // Create the TCP connection handle
  struct netconn* ftpsrvconn = netconn_new (NETCONN_TCP);
  LWIP_ERROR( "http_server: invalid ftpsrvconn", (ftpsrvconn != NULL), return; );

  // Bind to port 21 (FTP) with default IP address  and put the connection into LISTEN state
  netconn_bind (ftpsrvconn, NULL, FTP_SERVER_PORT);
  netconn_listen (ftpsrvconn);

  while (true) {
    if (netconn_accept (ftpsrvconn, &ftpconn) == ERR_OK) {
      cLcd::debug ("connection");
      ftpSrv.service (1, ftpconn);   // call the http function
      netconn_delete (ftpconn);      // delete the connection.
      }
    }
  }
//}}}

//{{{
void ftpServerInit() {

  const osThreadDef_t osFtpThread = { (char*)"ftp", ftpServerThread, osPriorityNormal, 0, 16000 };
  osThreadCreate (&osFtpThread, NULL);
  }
//}}}
